app/controllers/likes_controller.rb

  def create
    @status = Status.find(params[:like][:status])

    if !Like.find_by(status_id: params[:like][:status])
      @like = Like.new(status_id: params[:like][:status], user_id: params[:like][:user])
      if @like.save
---
SELECT  "likes".* FROM "likes" WHERE "likes"."status_id" = $1 LIMIT 1  [["status_id", 115]]
SELECT  "statuses".* FROM "statuses" WHERE "statuses"."id" = $1  ORDER BY "statuses"."created_at" DESC LIMIT 1  [["id", 83]]
INSERT INTO "likes" ("status_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["status_id", 65], ["user_id", 712], ["created_at", "2017-05-12 08:59:54.936179"], ["updated_at", "2017-05-12 08:59:54.936179"]]