app/controllers/statuses_controller.rb

INSERT INTO "statuses" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Day One Healthy Challenge"], ["content", "Banana Chocolate Smoothie"], ["created_at", "2017-05-12 06:47:20.389279"], ["updated_at", "2017-05-12 06:47:20.389279"]]
---
  def create
    if logged_in?
      @status = Status.new(status_params)
      if @status.save

SELECT  "statuses".* FROM "statuses" WHERE "statuses"."id" = $1  ORDER BY "statuses"."created_at" DESC LIMIT 1  [["id", 665]]
---
  def edit
    @status = Status.find(params[:id])

SELECT  "statuses".* FROM "statuses" WHERE "statuses"."id" = $1  ORDER BY "statuses"."created_at" DESC LIMIT 1  [["id", 667]]
UPDATE "statuses" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "statuses"."id" = $4  [["title", "Day One Healthy Challengesss"], ["content", "Banana Chocolate Smoothie"], ["updated_at", "2017-05-12 06:50:26.055427"], ["id", 365]]
---
  def update
    @status = Status.find(params[:id])

    if logged_in?
      if @status.update_attributes(status_params)

DELETE FROM "statuses" WHERE "statuses"."id" = $1  [["id", 454]]
SELECT  "statuses".* FROM "statuses" WHERE "statuses"."id" = $1  ORDER BY "statuses"."created_at" DESC LIMIT 1  [["id", 674]]
---
  def destroy
    Status.find(params[:id]).destroy